Revit 2015 API
View.SilhouetteLineStyleId Property
 Id of line style in used to draw silhouettes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")]
public ElementId SilhouetteLineStyleId { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")> _
Public Property SilhouetteLineStyleId As ElementId
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")]
public:
property ElementId^ SilhouetteLineStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property:
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This view does not contain display-related properties.
See Also
View Class
Autodesk.Revit.DB Namespace